IDEA Open Model
LongReinfEndType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 End type of longitudional reinforcement
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum LongReinfEndType
Public Enumeration LongReinfEndType
Members
Member name | Value | Description
None | 0 |  None
Bend | 1 |  Bend
Hook | 2 |  Hook
Loop | 3 |  Loop
WeldedTransverseBar | 4 |  WeldedTransverseBar
ContinuousBar | 5 |  Continuous bar - full anchorage
ContinuousBarOutside | 6 |  Continuous bar outside - no anchorage
Hook90DegreeACI | 7 |  90 degree hook for ACI
Hook180DegreeACI | 8 |  180 degree hook for ACI
See Also
Reference
IdeaRS.OpenModel.Detail Namespace